import random
first_name = ['茹珺', '云舒', '珺睿', '惠雅', '珺菡', '安娜', '媛娜', '惠睿',
              '晴茜', '岚嫦', '云涵', '晴惠', '怡翎', '裕梅', '涵惠', '惠絮',
              '涵菡', '雯婷', '寒淑', '润洁', '秉文', '晴清', '淑涵', '珺涵',
              '云华', '舒媛', '素娅', '花曼', '岚雅', '清华', '寒菊', '涵茵',
              '岚菡', '欣琳', '熙玉', '岚菲', '寒云', '茹絮', '寒媛', '岚瑜',
              '正妍', '琳竣', '淑淑', '惠语', '寒华', '涵婷', '晴珺', '妍如',
              '榕嫣', '寒瑜', '云嫦', '茵清', '茵嫣', '惠云', '洁玲', '雨蓉',
              '翔雯', '淑梦', '晴菡', '珺云', '清雅', '梓婧', '雯婧', '雯嘉',
              '雯舒', '茜菡', '云嫣', '清梦', '秀珊', '欣怡', '惠茜', '茜华',
              '茜茜', '舒菲', '婷雯', '晓悦', '芷秀', '欣瑶', '曦秀', '婷丽',
              '莉娜', '东玲', '巧娜', '佳艳', '秀秀', '新颖', '依娜', '欣瑶',
              '梦洁', '菁茹', '泽芳', '怡若', '陈红', '婧宁', '美怡', '悦帆',
              '莹莹', '莉绫', '德梅', '燕萍', '瑛蔓', '鹤梅', '蓉华', '佳莉',
              '蔡琳', '婧妍', '斯玉', '恺玲', '珂妍', '小莉', '成美', '倩冰',
              '优美', '长丽', '瑜文', '姝瑶', '春颖', '华琳', '妍婷', '娉娟',
              '燕艳', '妍青', '静美', '禾悦', '妍凌', '惋洁', '清嘉', '茜媛',
              '涵茹', '惠晴', '茵惠', '岚雁', '茜菲', '媛菲', '珺绮', '茹菲',
              '涵嫣', '翔鸣', '雨花', '思艳', '寒岚', '茜嫦', '茜菊', '涵媛',
              '淑云', '辰蓉', '贞颖', '舒嫣', '清云', '茵萍', '淑华', '媛语',
              '琳爰', '君茹', '云晴', '寒鸣', '云清', '岚华', '淑惠', '颜英',
              '真文', '雯语', '晴茹', '雯晴', '雯睿', '清茜', '青蓉', '妍羽',
              '芬迎', '恬梨', '芙婕', '宸旋', '翾琳', '丽霞', '悦淇', '桐卿',
              '宸英', '芳梨', '铭倩', '睿琳', '莉娉', '纯雪', '仲媛', '湘怡',
              '怡丞', '秀琴', '滇萍', '薇颖', '映蓉', '长英', '丽美', '夕文',
              '琳涵', '燕星', '善玲', '琴子', '筱雪', '旭妍', '蝾婷', '怡婷',
              '莉颖', '芹悦', '翔嘉', '晴岚', '晴翠', '雅舒', '茹语', '若美',
              '娅清', '翔媛', '惠嘉', '云絮', '茹云', '雯翔', '寒睿', '舒玉',
              '雅淑', '雯嫣', '岚茹', '雯淑', '茜云', '寒嫣', '涵绮', '晴睿',
              '茜梦', '云菡', '岚萍', '茵雅', '莉萍', '梦丽', '涵菲', '茵茹',
              '晴茵', '岚婷', '涵语', '雯瑛', '惠淑', '寒雁', '淑雅', '岚舒',
              '婷雯', '梓悦', '秀娟', '瑶华', '芝蓉', '娅庭', '树艳', '小霞',
              '厦洁', '卷玉', '欣颖', '世悦', '艳蓉', '丹洁', '玲娇', '卓妍',
              '杭英', '玲丽', '睿颖', '炜琳', '雨莹', '炜婷', '丽英', '忠燕',
              '瑞芬', '婧文', '惠芳', '炎琳', '秀颖', '翠萍', '爱茹', '艳霞',
              '龙艳', '嫣钰', '志芳', '芷茹', '悦颖', '红英', '焱霞', '婷秀',
              '惠玲', '于娜', '沁媛', '诺瑶', '梓燕', '秀君', '昊怡', '小妍',
              '悦张', '秀芳', '欣怡', '晓梅', '午瑶', '会霞', '龙梅', '琳敏',
              '展文', '羽莹', '艺萍', '月玲', '歌玲', '海燕', '晶婧', '尤文',
              '仪琳', '玉娟', '钰洁', '雪娟', '卿蓉', '晓洁', '家颖', '安茹',
              '湘媛', '丹梅', '薏冉', '婷昱', '怡可', '琳淼', '卓婷', '瓶花',
              '爱萍', '桂燕', '石英', '腊梅', '雅莉', '莉娅', '娟娣', '艳红',
              '棠莉', '悦驰', '婉婷', '嘉洁', '彩红', '媛雪', '美芳', '莉轩',
              '燕齐', '昕妍', '倡文', '紊文', '子婧', '爱琴', '维娟', '思娜',
              '振文', '鸾瑶', '玲丽', '旦娅', '苏娟', '羽洁', '秋艳', '建颖',
              '泓茹', '富霞', '倩成', '诗茹', '承文', '雪芬', '妍玲', '晓霞',
              '依婷', '瑾琳', '永琴', '翰颖', '婉燕', '景文', '赛玉', '晓玉',
              '晋玉', '幸瑶', '歆琳', '曾燕', '国政', '彩娟', '三婷', '雪婧',
              '义文', '雪萍', '津文', '琳秀', '燕明', '纯洁', '素莉']

last_names = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚',
              '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕',
              '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚',
              '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛',
              '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花',
              '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉',
              '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝',
              '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康',
              '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧',
              '尹', '姚', '邵', '堪', '汪', '祁', '毛', '禹', '狄', '米', '贝',
              '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊',
              '纪', '舒', '屈', '项', '祝', '董', '梁']

Company_first = ['天神', '奥飞', '华视', '磨铁', '星辉', '互动', '天下', '久游',
                 '', '', '', '', '', '', '', '',
                 '', '', '', '', '', '', '', '',
                 '', '', '', '', '', '', '', '',
                 ]


def make_person_name() -> str:
    f = random.randint(0, len(first_name) - 1)
    l = random.randint(0, len(last_names) - 1)
    return last_names[l] + first_name[f]


if __name__ == "__main__":
    print(make_name())
